Repository: Stand-With-Palestine/CrowdTweet
Catalog: apps/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Content
ar: المـحتوى

source: Media File
ar: اضافة ملف وسائط

source: About Us
ar: من نحن

source: Our project is a support for the original Campaign
ar: مشروعنا عبارة عن دعم للحـملة الأصلية

source: What's the Campaign
ar: مـا هي الحـملة

source: An awareness campaign aimed at stopping the aggression on Gaza and lifting the blockade through exposing Zionist media manipulation by posting tweets in English on Twitter and revealing the facts to the Western and Arab world about what is happening in Gaza
ar: حملة إعلامية تهدف إلى إيقاف العدوان على غزة، وفك الحصار، من خلال تبين التزييف الإعلامي الصهيوني وذلك بنشر تغريدات باللغة الإنجليزية على تويتر، وكشف الحقائق للعالم الغربي والعربي على ما يجري في غزة

source: Sign In
ar: تـسجيل الدخول

source: Forgot Password?
ar: نـسيت كلمة المرور

source: Stand With Gaza campaign
ar: حملة نُـصرة غزه

source: Home
ar: الصفحه الرئيسية

source: Post Tweet
ar: انـشر الآن

source: Logout
ar: تسـجيل الخروج

source: Login
ar: تسـجيل الدخول

source: Menu
ar: القـائمة

source: In support of Palestine
ar: من أجل فلسطين

source: Resist as much as you can
ar: قاوم بما تستطيع

source: Here, we aim to ignite the spark of change and uncover hidden truths
ar: نسعى هنا إلى إشعال شرارة التغيير وكشف الحقائق الخفية

source: It's a Twitter awareness campaign that springs from the depths of our hearts to change the narrative and expose deception
ar: إنها حملة إعلامية على تويتر تنطلق من أعماق القلوب لتغيير الرواية وكشف التضليل

source: If you're ready to participate in this effort, you have the opportunity now. Join us by clicking the button below
ar: إذا كنتم مستعدين للمشاركة في هذا الجهد، فلديكم الفرصة الآن. انضموا إلينا بالنقر على الزر أدناه

source: Resist
ar: قــاوم

source: and we will share the facts in your voices in foreign languages to make the world hear us. Here, you don't just have a chance to participate but a chance to change the narrative and influence the world with your story. Get started and be a part of this creative campaign
ar: وسنقوم بنشر الحقائق بأصواتكم بلغات أجنبية، لنجعل العالم يسمعنا. هنا، ليس لديكم مجرد فرصة للمشاركة بل فرصة لتغيير السرد والتأثير على العالم بقصتكم. انطلقوا وكونوا جزءًا من هذه الحملة الإبداعية

source: This project has been prepared by young Arabs who are passionate about their cause
ar: تم تجهيز هذا المشروع من قبل شباب عربي غيور على قضيته

source: The link to allow the platform to share on your accounts so you can be part of the resistance with your words
ar: رابط السماح للمنصة بالمشاركة على حساباتكم لتكونو جزءً من المقاومة بالكلمة

source: sign in with twitter
ar: تسـجيل الدخول بواسطة تويتر

source: Go To Twitter
ar: اذهب الى تويتر

source: Submit
ar: انشر
